gastonfeng/bootloader_stm32/mFirmata.cpp
            case PIN_MODE_SERVO:
                if (IS_PIN_DIGITAL(pin))
                {
                    fm->setPinMode(pin, PIN_MODE_SERVO);
                    if (servoPinMap[pin] == 255 || !servos[servoPinMap[pin]].attached())
                    {
                        // pass -1 for min and max pulse values to use default values set
                        // by Servo library
                        attachServo(fm, fs, pin, -1, -1);
                    }
                }
                break;
#endif
#ifdef USE_FIRMATA_WIRE
            case PIN_MODE_I2C:
                if (IS_PIN_I2C(pin))
                {
                    // mark the pin as i2c
                    // the user must call I2C_CONFIG to enable I2C for a device
                    fm->setPinMode(pin, PIN_MODE_I2C);
                }
                break;
#endif
        case PIN_MODE_SERIAL:
#ifdef FIRMATA_SERIAL_FEATURE
            serialFeature.handlePinMode(fm, pin, PIN_MODE_SERIAL);
#endif
            break;
        default:
            fm->sendString(Fs, "Unknown pin mode");
    }
}

#endif

int soem_scan(firmata::FirmataClass *fm, Stream *);

void analogWriteCallback(firmata::FirmataClass *fm, Stream *, byte i, int val);

#ifdef USE_LFS

#include "flashFs.h"
#include "mFirmata.h"

extern FlashFs flash_fs;
#endif

void stringCallback(firmata::FirmataClass *fc, Stream *Fs, char *myString) {
#ifdef USE_LFS
    if (strncmp(myString, "rm ", 3) == 0)
    {
        if (flash_fs.unlink(&myString[3]) == 0)
            fc->sendString(Fs, "rm ok");
        else
            fc->sendString(Fs, "rm fail");
    }
    else
#endif
    fc->sendString(Fs, "unknown input");
}

int decodeByteStream(size_t bytec, const byte *bytev, byte *buf) {
    u8 bits = 7;
    int i = 0, j = 0;
    u8 a;
    while (i < bytec - 1) {
        a = bytev[i] >> (7 - bits);
        a |= (bytev[i + 1] << bits) & 0xff;
        buf[j++] = a;
        i += 1;
        bits -= 1;
        if (bits == 0) {
            bits = 7;
            i += 1;
        }
    }
    return j;
}

extern "C" void core_debug_uart(bool v);

int fill_dbg(int index, u8 *buf);

void sysexCallback(firmata::FirmataClass *fm, Stream *FirmataStream, byte command, uint16_t argc, byte *argv) {
    int len_data;
    int index;
    int tlen1;
    char *buffer;
    int state;
    int l1;
    u32 start, end;
    char bufs[256];
    u32 indexv;
    int decodedLen;

    tm new_time{};
    struct {
        u32 build;
        char name[8];
    } info{};
    byte decodeBuf[16];
    auto *mfm = (mFirmata *) fm;
    switch (command) {
        case firmata::ARE_YOU_THERE:
#if defined(RTE_APP)||defined(PLC)
            core_debug_uart(false);
            logger.disable(logger_t::LOGGER_SERIAL);
#endif
            fm->write(FirmataStream, START_SYSEX);
            fm->write(FirmataStream, firmata::I_AM_HERE);
            fm->write(FirmataStream, 1); // arduino_instance_id
            fm->write(FirmataStream, END_SYSEX);
            fm->flush(FirmataStream);
            break;
        case firmata::I_AM_HERE:
            if (mfm->i_am_here_cb)
                mfm->i_am_here_cb(mfm, FirmataStream);
            break;
#if defined(RTE_APP)||defined(PLC)
            case SAMPLING_INTERVAL:
                if (argc > 1) {
                    rte.info.samplingInterval = (byte) (argv[0] + (argv[1] << 7));
                    if (rte.info.samplingInterval < rte.plc_config.MINIMUM_SAMPLING_INTERVAL) {
                        rte.info.samplingInterval = rte.plc_config.MINIMUM_SAMPLING_INTERVAL;
                    }
                } else {
                    // sendString("Not enough data");
                }
                break;
            case REPORT_ANALOG:
                byte bu[2];
                if (argc == 3) {
                    decodeByteStream(argc, (const byte *) argv, bu);
                    reportAnalogCallback(fm, FirmataStream, bu[0], bu[1]);
                }
                break;
            case EXTENDED_ANALOG:
                if (argc > 1) {
                    int al = argv[1];
                    if (argc > 2)
                        al |= (argv[2] << 7);
                    if (argc > 3)
                        al |= (argv[3] << 14);
                    analogWriteCallback(fm, FirmataStream, argv[0], al);
                }
                break;
            case CAPABILITY_QUERY:
                fm->write(FirmataStream, START_SYSEX);
                fm->write(FirmataStream, CAPABILITY_RESPONSE);
                board.capability_query(fm, FirmataStream);
                fm->write(FirmataStream, END_SYSEX);
                fm->flush(FirmataStream);
                break;
            case PIN_STATE_QUERY:
                if (argc > 0) {
                    byte pin = argv[0];
                    fm->write(FirmataStream, START_SYSEX);
                    fm->write(FirmataStream, PIN_STATE_RESPONSE);
                    fm->write(FirmataStream, pin);
                    if (pin < IO_YO_NRS + IO_XI_NRS + IO_XA_NRS + IO_YA_NRS) {
                        fm->write(FirmataStream, fm->getPinMode(pin));
                        fm->write(FirmataStream, (byte) fm->getPinState(pin) & 0x7F);
                        if (fm->getPinState(pin) & 0xFF80)
                            fm->write(FirmataStream, (byte) (fm->getPinState(pin) >> 7) & 0x7F);
                        if (fm->getPinState(pin) & 0xC000)
                            fm->write(FirmataStream, (byte) (fm->getPinState(pin) >> 14) & 0x7F);
                    }
                    fm->write(FirmataStream, END_SYSEX);
                    fm->flush(FirmataStream);
                }
                break;
            case ANALOG_MAPPING_QUERY:
                fm->write(FirmataStream, START_SYSEX);
                fm->write(FirmataStream, ANALOG_MAPPING_RESPONSE);
                board.analog_mapping_query(fm, FirmataStream);

                fm->write(FirmataStream, END_SYSEX);
                fm->flush(FirmataStream);
                break;

            case SERIAL_MESSAGE:
#ifdef FIRMATA_SERIAL_FEATURE
                serialFeature.handleSysex(fm, command, argc, argv);
#endif
                break;
            case CB_GET_REMAIN_MEM:
                fm->sendSysex(FirmataStream, CB_GET_REMAIN_MEM, 2, (byte *) &rte.info.remain_mem);
                break;
            case CB_GET_RTE_VERSION:
                fm->sendSysex(FirmataStream, CB_GET_RTE_VERSION, sizeof(rte_ver), (uint8_t *) &rte_ver);
                break;
            case CB_PLC_START:
                rte.app_start();
                fm->write(FirmataStream, START_SYSEX);
                fm->write(FirmataStream, CB_PLC_START);
                fm->write(FirmataStream, 0);
                fm->write(FirmataStream, END_SYSEX);
                fm->flush(FirmataStream);
                break;
            case CB_PLC_STOP:
                rte.app_stop();
                fm->write(FirmataStream, START_SYSEX);
                fm->write(FirmataStream, CB_PLC_STOP);
                fm->write(FirmataStream, 0);
                fm->write(FirmataStream, END_SYSEX);
                fm->flush(FirmataStream);
                break;
            case REPORT_PLC_MD5:
                if (rte.info.plc_curr_app)
                    fm->sendSysex(FirmataStream, REPORT_PLC_MD5, 32, (byte *) rte.info.plc_curr_app->id);
                else
                    fm->sendSysex(FirmataStream, REPORT_PLC_MD5, 0, (byte *) "");
                break;
            case CB_PLC_LOAD:
                fm->write(FirmataStream, START_SYSEX);
                fm->write(FirmataStream, CB_PLC_LOAD);
                fm->write(FirmataStream, 0);
                fm->write(FirmataStream, END_SYSEX);
                fm->flush(FirmataStream);
                rte.app_stop();
                app.unload();
                rte.load_app();
                break;
            case CB_PLC_REPAIR:
                rte.app_stop();
                app.unload();
                fm->write(FirmataStream, START_SYSEX);
                fm->write(FirmataStream, CB_PLC_REPAIR);
                fm->write(FirmataStream, 0);
                fm->write(FirmataStream, END_SYSEX);
                fm->flush(FirmataStream);
                break;
#endif
#ifdef USE_LFS
            case FM_FLASH_CLEAR:
                fm->sendSysex(FirmataStream, FM_FLASH_CLEAR, 0, nullptr);
                flash_fs.clear();
                board.reset();
                break;
#endif
#if defined(USE_RTC) || defined(USE_PCF8563)
            case CB_GET_RTC:
                fm->sendSysex(FirmataStream, CB_GET_RTC, sizeof(rtc_t), (byte *) &rte.info.rtc);
                break;
            case CB_SET_RTC:
                new_time.tm_year = *(u16 *) &argv[0];
                new_time.tm_mon = argv[2];
                new_time.tm_mday = argv[3];
                new_time.tm_hour = argv[4];
                new_time.tm_min = argv[5];
                new_time.tm_sec = argv[6];
                new_time.tm_wday = argv[7];
                board.set_time(&new_time);
                fm->sendSysex(FirmataStream, CB_SET_RTC, 0, nullptr);
                break;
#endif
#ifdef ARDUINO
#ifdef USE_LWIP
#ifdef USE_IP_MODIFY
            case CB_SET_IP:
                byte ip[4];
                decodeByteStream(argc, (const byte *) argv, ip);
                rte.plc_config.ip.ip1 = ip[0];
                rte.plc_config.ip.ip2 = ip[1];
                rte.plc_config.ip.ip3 = ip[2];
                rte.plc_config.ip.ip4 = ip[3];
                board.setip();
                fm->sendSysex(FirmataStream, CB_SET_IP, 4, (byte *) (&rte.plc_config.ip));
                break;
#endif
            case CB_GET_IP:
                fm->sendSysex(FirmataStream, CB_GET_IP, 4, (byte *) (&rte.plc_config.ip));
                break;
            case FM_GET_NET_BUF_STAT:
                buffer = (char *) malloc(13 * MEMP_MAX);
                for (int i = 0; i < MEMP_MAX; i++) {
                    *(u8 *) &buffer[0 + 13 * i] = memp_pools[i]->stats->avail;
                    *(u8 *) &buffer[1 + 13 * i] = memp_pools[i]->stats->err;
                    *(u8 *) &buffer[2 + 13 * i] = memp_pools[i]->stats->illegal;
                    *(u8 *) &buffer[3 + 13 * i] = memp_pools[i]->stats->max;
                    *(u8 *) &buffer[4 + 13 * i] = memp_pools[i]->stats->used;
                    memcpy(&buffer[5 + 13 * i], memp_pools[i]->stats->name, 8);
                }
                fm->sendSysex(FirmataStream, FM_GET_NET_BUF_STAT, 13 * MEMP_MAX, (byte *) buffer);
                free(buffer);
                break;
#endif
            case CB_RESET:
                fm->sendSysex(FirmataStream, CB_RESET, 0, nullptr);
                rte.reset();
                break;
            case CB_GOTO_IAP:
                fm->sendSysex(FirmataStream, CB_GOTO_IAP, 0, nullptr);
                board.goto_iap();
                break;
#ifdef MONITOR_SERIAL
                case CB_YMODEM:
                    u8 res;
                    res = 0;
                    fm->sendSysex(FirmataStream, CB_YMODEM, 1, &res);
                    rte.set_state(PLC_STATUS::Ymodem);
                    rtos::Delay(100);
                    board.start_ymodem();
                    rte.set_state(PLC_STATUS::Stopped);
                    break;
#endif
#ifdef USE_FREERTOS
            case CB_THREAD_INFO:
                typedef struct {
                    u32 xTaskNumber;           /* A number unique to the task. */
                    uint32_t ulRunTimeCounter; /* The total run time allocated to the task so far, as defined by the run time stats clock.  See http://www.freertos.org/rtos-run-time-stats.html.  Only valid when configGENERATE_RUN_TIME_STATS is defined as 1 in FreeRTOSConfig.h. */
                    u32 pxStackBase;           /* Points to the lowest address of the task's stack area. */
                    uint16_t usStackHighWaterMark;
                    char name[8];
                    uint16_t eCurrentState;       /* The state in which the task existed when the structure was populated. */
                    uint16_t uxCurrentPriority; /* The priority at which the task was running (may be inherited) when the structure was populated. */
                    uint16_t uxBasePriority;    /* The priority to which the task will return if the task's current priority has been inherited to avoid unbounded priority inversion when obtaining a mutex.  Only valid if configUSE_MUTEXES is defined as 1 in FreeRTOSConfig.h. */
                } task_info;
                u32 task_num;
                u32 TotalRunTime;
                TaskStatus_t *StatusArray;
                task_num = uxTaskGetNumberOfTasks();
                buffer = (char *) malloc(task_num * sizeof(task_info));
                StatusArray = (TaskStatus_t *) pvPortMalloc(task_num * sizeof(TaskStatus_t));
                if (StatusArray != nullptr) {
                    uxTaskGetSystemState(StatusArray, (UBaseType_t) task_num, (uint32_t *) &TotalRunTime);
                }
                for (int i = 0; i < task_num; i++) {
                    auto *d = (task_info *) &buffer[i * sizeof(task_info)];
                    auto *s = (TaskStatus_t *) &StatusArray[i];
                    memcpy(d->name, s->pcTaskName, 8);
                    d->xTaskNumber = s->xTaskNumber;
                    d->eCurrentState = s->eCurrentState;
                    d->pxStackBase = (u32) s->pxStackBase;
                    d->ulRunTimeCounter = s->ulRunTimeCounter;
                    d->uxBasePriority = s->uxBasePriority;
                    d->usStackHighWaterMark = s->usStackHighWaterMark;
                    d->uxCurrentPriority = s->uxCurrentPriority;
                }
                fm->sendSysex(FirmataStream, CB_THREAD_INFO, (task_num * sizeof(task_info)), (byte *) (buffer));
                vPortFree(StatusArray);
                free(buffer);
                break;
#endif
#endif
#if defined(RTE_APP)||defined(PLC)
            case CB_SET_FORCE:
                for (int i = 0; i < argc;) {
                    const u16 *byte = (u16 *) &argv[i];
                    u8 len = argv[i + 2];
                    index = *byte;
                    if (rte.info.plc_state == PLC_STATUS::Started) {
                        rte.info.plc_curr_app->dbg_set_force(index, len ? &argv[i + 3] : nullptr);
                    }
                    i += len + 3;
                }
                fm->write(FirmataStream, START_SYSEX);
                fm->write(FirmataStream, CB_SET_FORCE);
                fm->write(FirmataStream, argc);
                fm->write(FirmataStream, END_SYSEX);
                fm->flush(FirmataStream);
                break;

            case CB_CLEAR_V:
                if (rte.info.plc_state == PLC_STATUS::Started) {
                    rte.info.plc_curr_app->dbg_vars_reset(__IEC_DEBUG_FLAG);
                    logger.debug("monitor var reset.");
                } else {
                    logger.debug("monitor var not reset.plc_state=0x%x ", rte.info.plc_state);
                }
                fm->write(FirmataStream, START_SYSEX);
                fm->write(FirmataStream, CB_CLEAR_V);
                fm->write(FirmataStream, 0);
                fm->write(FirmataStream, END_SYSEX);
                fm->flush(FirmataStream);
                break;
            case CB_SET_V:
                // decodedLen = base64_dec_len((char *)argv, argc);
                decodedLen = base64_decode(bufs, (char *) argv, argc);
                logger.debug("set_v %d -> %d", argc, decodedLen);
                for (int i = 0; i < decodedLen; i += 2) {
                    const u16 *byte = (u16 *) &bufs[i];
                    indexv = *byte;
                    logger.debug("%d", indexv);
                    if (rte.info.plc_state == PLC_STATUS::Started) {
                        rte.info.plc_curr_app->dbg_var_register(indexv);
                    }
                }
                fm->write(FirmataStream, START_SYSEX);
                fm->write(FirmataStream, CB_SET_V);
                fm->write(FirmataStream, decodedLen);
                fm->write(FirmataStream, END_SYSEX);
                fm->flush(FirmataStream);
                break;
            case CB_GET_V:
                u32 tick;
                int len;
                u8 *data;
                tick = 0;
                len = 0;
                data = nullptr;
                if (rte.info.plc_state == PLC_STATUS::Started) {
                    rte.info.plc_curr_app->dbg_data_get(&tick, (u32 *) &len, (void **) &data);
                    rte.info.plc_curr_app->dbg_data_free();
                }

