gastonfeng/bootloader_stm32/mFirmata.cpp
int mFirmata::loop(Stream *FirmataStream) {
    while (available(FirmataStream)) {
        processInput(FirmataStream);
    }
    report(FirmataStream);
    return 0;
}

mFirmata::mFirmata() {
    disableBlinkVersion();
    setFirmwareVersion(FIRMATA_FIRMWARE_MAJOR_VERSION, FIRMATA_FIRMWARE_MINOR_VERSION);
    attach(STRING_DATA, stringCallback);
    attach(START_SYSEX, sysexCallback);
    // attach(ANALOG_MESSAGE, analogWriteCallback);
    // attach(DIGITAL_MESSAGE, digitalWriteCallback);
    // attach(REPORT_ANALOG, reportAnalogCallback);
    // attach(REPORT_DIGITAL, reportDigitalCallback);
    // attach(SET_DIGITAL_PIN_VALUE, setPinValueCallback);
    // attach(SET_PIN_MODE, setPinModeCallback);
    // attach(SYSTEM_RESET, systemResetCallback);
    i_am_here_cb = nullptr;
}

void mFirmata::report(Stream *FirmataStream) {
#if defined(RTE_APP)||defined(PLC)
    u32 currentMillis = rtos::ticks();

    if (currentMillis - previousMillis > rte.plc_config.reportInterval) {
        previousMillis += rte.plc_config.reportInterval;
        /* ANALOGREAD - do all analogReads() at the configured sampling interval */
        board.readAnalogValue(this, FirmataStream, analogInputsToReport, sizeof(analogInputsToReport));
        for (byte pin = 0; pin < IO_XI_NRS + IO_YO_NRS; pin++) {
            if (reportPINs[pin]) {
                outputPort(FirmataStream, pin, getPinState(pin), true);
            }
        }
    }
#ifdef FIRMATA_SERIAL_FEATURE
    serialFeature.update(this, FirmataStream);
#endif
    // if (queryIndex > -1) {
    //     for (byte i = 0; i < queryIndex + 1; i++) {
    //         readAndReportData(Firmata, query[i].addr, query[i].reg, query[i].bytes, query[i].stopTX);
    //     }
    // }
#endif
}

void mFirmata::outputPort(Stream *FirmataStream, byte portNumber, byte portValue, byte forceSend) {
    // pins not configured as INPUT are cleared to zeros
    //    portValue = portValue & portConfigInputs[portNumber];
    // only send if the value is different than previously sent
    if (portNumber < (IO_XI_NRS + IO_YO_NRS) && (forceSend || previousPINs[portNumber] != portValue)) {
        sendDigitalPort(FirmataStream, portNumber, portValue);
        flush(FirmataStream);
        previousPINs[portNumber] = portValue;
    }
}

#ifdef windows_x86
#include<pthread.h>
#include <minwindef.h>
#include <profileapi.h>
#include <sysinfoapi.h>
u32 ticks() {
    static LARGE_INTEGER s_frequency;
    static BOOL s_use_qpc = QueryPerformanceFrequency(&s_frequency);
    if (s_use_qpc) {
        LARGE_INTEGER now;
        QueryPerformanceCounter(&now);
        return (1000LL * now.QuadPart) / s_frequency.QuadPart;
    }
//    else {
//        return GetTickCount();
//    }
}
void Delay(u32 ms) {
    struct timespec interval{};
    interval.tv_nsec = ms * 1000000;
    pthread_delay_np(&interval);
}
#endif

int mFirmata::setValue(Stream *FirmataStream, int index, void *valBuf, u8 size) {
    byte *buf;
    buf = (byte *) malloc(size + 4);
    *(int *) buf = index;
    memcpy(&buf[4], valBuf, size);
    sendSysex(FirmataStream, FM_WRITE_VALUE, size + 4, (byte *) buf);
    free(buf);
#if defined(RTE_APP)||defined(PLC)
    u32 tick = rtos::ticks() + 100;
#else
    u32 tick = ticks() + 100;
#endif
    while (get_flag(FM_WRITE_VALUE) == 0) {
#if defined(RTE_APP)||defined(PLC)
        rtos::Delay(1);
        if (rtos::ticks() > tick)
#else
        Delay(1);
        if (ticks() > tick)
#endif
            return TIMEOUT;
    }
    return 0;
}

int mFirmata::get_flag(u16 cmd) {
    return respose[cmd / 8] & (1 << (cmd % 8));
}

int mFirmata::clr_flag(u16 cmd) {
    respose[cmd / 8] &= ~(1 << (cmd % 8));
    return 0;
}

int mFirmata::set_flag(u16 cmd) {
    if (cmd < FM_LAST) {
        respose[cmd / 8] |= (1 << (cmd % 8));
        return 0;
    }
    return -1;
}

int mFirmata::getValue(Stream *pStream, int index, u8 *value_buf) {
    sendSysex(pStream, FM_READ_VALUE, 4, (byte *) &index);
#if defined(RTE_APP)||defined(PLC)
    u32 tick = rtos::ticks() + 100;
#else
    u32 tick = ticks() + 100;
#endif
    while (get_flag(FM_READ_VALUE) == 0) {
#if defined(RTE_APP)||defined(PLC)
        rtos::Delay(1);
        if (rtos::ticks() > tick)
#else
        Delay(1);
        if (ticks() > tick)
#endif
            return TIMEOUT;
    }
    memcpy(value_buf, valueBuf, valueLen);
    return valueLen;
}
